INSERT INTO documents
VALUES (1,
        'Оказание услуг по техническому обслуживанию и поддержке программного обеспечения «ГРАНД-Смета» для нужд Читинского филиала ФГКУ Росгранстрой',
        '100297672122100033 ',
        '2022-12-28',
        'Единственный поставщик',
        168000.00,
        '2023-01-01',
        '2023-12-31',
        '',
        'ООО ГРАНДСОФТ',
        '2022-12-28 13:45:00');

INSERT INTO public.documents
VALUES (2,
        'Оказание услуг по техническому обслуживанию',
        'CHT00-17-17-23 ',
        '2022-12-28',
        'Аукцион',
        10500.34,
        '2023-01-01',
        '2023-12-31',
        '',
        'ПАО Мегафон',
        '2022-12-28 13:45:00');

INSERT INTO files
VALUES (1, 'abc-dsd-asd-0156', 123.2, '.\upload', 1);
INSERT INTO files
VALUES (2, 'cdf-dsd-asd-0123', 133.2, '.\upload', 2);
INSERT INTO files
VALUES (3, 'rty-dsd-asd-01xs1', 3.2, '.\upload', 2);